testSB/src/InformationRegisters/ТарифыУслугСортировки/ТарифыУслугСортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыУслугСортировки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипГрузовогоМеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УслугаСортировки</name>
    <type>
      <types>EnumRef.УслугаСортировки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

testSB/src/Enums/УслугаСортировки/УслугаСортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УслугаСортировки</name>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
</mdclass:Enum>

testSB/src/InformationRegisters/ТарифыУслугСортировки/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	ЗаполнитьПоУмолчаниюНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПоУмолчаниюНаСервере()

	МассивДанных = Новый Массив();

	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "МГТ",
		Перечисления.УслугаСортировки.Обработка, 10));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "Шины",
		Перечисления.УслугаСортировки.Обработка, 50));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "КГТ",
		Перечисления.УслугаСортировки.Обработка, 100));
		
	МассивДанных.Добавить(	
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "МГТ",
		Перечисления.УслугаСортировки.Хранение, 10));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "Шины",
		Перечисления.УслугаСортировки.Хранение, 10));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "КГТ",
		Перечисления.УслугаСортировки.Хранение, 10));
	МассивДанных.Добавить(
		Новый Структура("ТипГрузовогоМеста, УслугаСортировки, Стоимость", "Хаб",
		Перечисления.УслугаСортировки.Хранение, 10));

	ДатаЗаписи = Дата(2022, 08, 01);
			
	Для Каждого эл Из МассивДанных Цикл
		рег = РегистрыСведений.ТарифыУслугСортировки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(рег, эл);
		рег.Период = ДатаЗаписи;
		рег.Записать(); 
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
